In [1]:
# Ekranı genişletmek için: 
from IPython.core.display import display, HTML 
display(HTML("<style>.container { width:90% !important; }</style>"))

C:\Users\Ali\AppData\Local\Temp\ipykernel_17592\2201182048.py:2: DeprecationWarning: Importing display from IPython.core.display is deprecated since IPython 7.14, please import from IPython display
  from IPython.core.display import display, HTML

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

# PANDAS

## VERİ SEÇİMİ

In [5]:

students_df = pd.DataFrame({
    'İsimler': ['Melike', 'Baris', 'Almila', 'Amir', 'Ceyda'],
    'Yaş': [21, 22, 20, 21, 23],
    'Böl': ['Math', 'Physics', 'Biology', 'Math', 'Physics']
    }, index=['st1', 'st2', 'st3', 'st4', 'st5'])

In [6]:
students_df

    İsimler  Yaş      Böl
st1  Melike   21     Math
st2   Baris   22  Physics
st3  Almila   20  Biology
st4    Amir   21     Math
st5   Ceyda   23  Physics

In [7]:
## LOC

In [8]:
students_df.loc['st3','Yaş']

20

In [9]:
students_df.loc['st3']

İsimler     Almila
Yaş             20
Böl        Biology
Name: st3, dtype: object

In [10]:
students_df.loc['st2':'st4']

    İsimler  Yaş      Böl
st2   Baris   22  Physics
st3  Almila   20  Biology
st4    Amir   21     Math

In [11]:
students_df.loc['st2':'st4', 'İsimler':'Yaş']

    İsimler  Yaş
st2   Baris   22
st3  Almila   20
st4    Amir   21

In [12]:
## ILOC

In [13]:
 students_df.iloc[1:3,0:2]

    İsimler  Yaş
st2   Baris   22
st3  Almila   20

In [14]:
 students_df.iloc[1:4, 0:2]

    İsimler  Yaş
st2   Baris   22
st3  Almila   20
st4    Amir   21

In [15]:
## Filter with Loc and Iloc

In [16]:
students_df.loc[students_df['Böl'] == 'Biology']

    İsimler  Yaş      Böl
st3  Almila   20  Biology

In [17]:
## isin : in filtresi
students_df.loc[students_df['Böl'].isin(['Biology','Math'])]

    İsimler  Yaş      Böl
st1  Melike   21     Math
st3  Almila   20  Biology
st4    Amir   21     Math

In [18]:
students_df.loc[~students_df['Böl'].isin(['Biology','Math'])]

    İsimler  Yaş      Böl
st2   Baris   22  Physics
st5   Ceyda   23  Physics

In [19]:
## na selection
students_df.loc[students_df['Böl'].isna()]

Empty DataFrame
Columns: [İsimler, Yaş, Böl]
Index: []

In [20]:
## NOT NA
students_df.loc[~students_df['Böl'].isna()]

    İsimler  Yaş      Böl
st1  Melike   21     Math
st2   Baris   22  Physics
st3  Almila   20  Biology
st4    Amir   21     Math
st5   Ceyda   23  Physics

In [21]:
## NOT NA
students_df.loc[students_df['Böl'].notna()]

    İsimler  Yaş      Böl
st1  Melike   21     Math
st2   Baris   22  Physics
st3  Almila   20  Biology
st4    Amir   21     Math
st5   Ceyda   23  Physics

In [22]:
students_df[(students_df['Böl'] == 'Math')&(students_df['Yaş'] > 20)]

    İsimler  Yaş   Böl
st1  Melike   21  Math
st4    Amir   21  Math

In [23]:
## MULTI INDEX

In [24]:
# Veriler
index = pd.MultiIndex.from_arrays(
    [
        ['Math', 'Physics', 'Biology', 'Math', 'Physics'],   # Uzmanlık alanı
        ['M19', 'P18', 'B20', 'M19', 'P17'],                 # Grup
        ['Melike', 'Baris', 'Almila', 'Amir', 'Ceyda']       # İsim
    ],
    names=['Uzmanlık', 'Grup', 'Isimler']
)

# İçerik verisi
data = {
    'Yas': [21, 22, 20, 21, 23],
    'Not': [21, 22, 20, 21, 23]
}

# DataFrame oluşturma
df = pd.DataFrame(data, index=index)

print(df)

                       Yas  Not
Uzmanlık Grup Isimler
Math     M19  Melike    21   21
Physics  P18  Baris     22   22
Biology  B20  Almila    20   20
Math     M19  Amir      21   21
Physics  P17  Ceyda     23   23

In [25]:
df.groupby(level='Uzmanlık')['Yas'].mean()

Uzmanlık
Biology    20.0
Math       21.0
Physics    22.5
Name: Yas, dtype: float64

In [26]:
df.columns

Index(['Yas', 'Not'], dtype='object')

In [27]:
df

                       Yas  Not
Uzmanlık Grup Isimler
Math     M19  Melike    21   21
Physics  P18  Baris     22   22
Biology  B20  Almila    20   20
Math     M19  Amir      21   21
Physics  P17  Ceyda     23   23

In [28]:
df_reset= df.reset_index()

In [29]:
df_reset

  Uzmanlık Grup Isimler  Yas  Not
0     Math  M19  Melike   21   21
1  Physics  P18   Baris   22   22
2  Biology  B20  Almila   20   20
3     Math  M19    Amir   21   21
4  Physics  P17   Ceyda   23   23

In [30]:
df_reset.columns

Index(['Uzmanlık', 'Grup', 'Isimler', 'Yas', 'Not'], dtype='object')

In [31]:
df_reset.groupby(['Uzmanlık', 'Grup', 'Isimler']).mean()

                        Yas   Not
Uzmanlık Grup Isimler
Biology  B20  Almila   20.0  20.0
Math     M19  Amir     21.0  21.0
              Melike   21.0  21.0
Physics  P17  Ceyda    23.0  23.0
         P18  Baris    22.0  22.0

## Pandas'ta Toplama İşlemleri

In [33]:
students_data = {
    'İsimler': ['Melike', 'Baris', 'Almila', 'Amir', 'Ceyda'],
    'Yaş': [21, 22, 20, 21, 23],
    'Bölüm': ['Math', 'Physics', 'Biology', 'Math', 'Physics']
}

student_df= pd.DataFrame(students_data)

In [34]:
students_data

{'İsimler': ['Melike', 'Baris', 'Almila', 'Amir', 'Ceyda'],
 'Yaş': [21, 22, 20, 21, 23],
 'Bölüm': ['Math', 'Physics', 'Biology', 'Math', 'Physics']}

In [35]:
student_df= pd.DataFrame(students_data)

In [36]:
student_df['Yaş'].sum()

107

In [37]:
student_df['Yaş'].mean()

21.4

In [38]:
student_df['Yaş'].median()

21.0

In [39]:
student_df['Yaş'].max()

23

In [40]:
student_df['Yaş'].min()

20

In [41]:
student_df['Yaş'].mode()

0    21
Name: Yaş, dtype: int64

In [42]:
student_df['Yaş'].nunique()

4

In [43]:
students_df['Yaş'].quantile(0.75)

22.0

## Veri Gruplama


df.groupby(
    by,           # Hangi kolona göre gruplama yapılacak?
    level=None,   # Çok seviyeli indeks varsa hangi seviyeye göre gruplanacak?
    as_index=True,# Grup kolonları index olsun mu?
    sort=True     # Gruplar sıralansın mı?
).<aggregation>  # Örn: .sum(), .mean(), .count()

In [46]:
df = pd.DataFrame({
    'cinsiyet': ['erkek', 'kadın', 'erkek', 'kadın', 'erkek'],
    'yas': [25, 30, 22, 28, 35],
    'salary': [5000, 15000, 25000, 15000, 55000]
})

In [47]:
df

  cinsiyet  yas  salary
0    erkek   25    5000
1    kadın   30   15000
2    erkek   22   25000
3    kadın   28   15000
4    erkek   35   55000

In [48]:
df.groupby('cinsiyet').mean()

                yas        salary
cinsiyet
erkek     27.333333  28333.333333
kadın     29.000000  15000.000000

In [49]:
df.groupby('cinsiyet')['yas'].mean()

cinsiyet
erkek    27.333333
kadın    29.000000
Name: yas, dtype: float64

In [50]:
df.groupby('cinsiyet',as_index=False )['yas'].mean()

  cinsiyet        yas
0    erkek  27.333333
1    kadın  29.000000

In [51]:
df.groupby('cinsiyet',as_index=False)['yas'].mean()

  cinsiyet        yas
0    erkek  27.333333
1    kadın  29.000000

In [52]:
df.groupby('cinsiyet',as_index=False ).agg({'yas': ['mean','max','count']})

  cinsiyet        yas
                 mean max count
0    erkek  27.333333  35     3
1    kadın  29.000000  30     2

In [53]:
df.groupby(['cinsiyet','yas'], as_index=False).agg({'salary': ['mean','max','min']})

  cinsiyet yas   salary
                   mean    max    min
0    erkek  22  25000.0  25000  25000
1    erkek  25   5000.0   5000   5000
2    erkek  35  55000.0  55000  55000
3    kadın  28  15000.0  15000  15000
4    kadın  30  15000.0  15000  15000

In [54]:
## Rename grouped by columns
df.groupby(['cinsiyet','yas'], as_index=False).agg(
    avg_salary=('salary','mean'),
    max_salary=('salary','max'),
    min_salary=('salary','min')
).reset_index()

   index cinsiyet  yas  avg_salary  max_salary  min_salary
0      0    erkek   22     25000.0       25000       25000
1      1    erkek   25      5000.0        5000        5000
2      2    erkek   35     55000.0       55000       55000
3      3    kadın   28     15000.0       15000       15000
4      4    kadın   30     15000.0       15000       15000

In [55]:
df

  cinsiyet  yas  salary
0    erkek   25    5000
1    kadın   30   15000
2    erkek   22   25000
3    kadın   28   15000
4    erkek   35   55000

In [56]:
filtered_data= df[df['cinsiyet']=='erkek']

## Rename grouped by columns
filtered_data.groupby(['cinsiyet'], as_index=False).agg(
    avg_salary=('salary','mean'),
    max_salary=('salary','max'),
    min_salary=('salary','min')
).reset_index()

   index cinsiyet    avg_salary  max_salary  min_salary
0      0    erkek  28333.333333       55000        5000

In [57]:
df[df['yas']>21].groupby(['cinsiyet'], as_index=False).agg(
    avg_salary=('salary','mean'),
    max_salary=('salary','max'),
    min_salary=('salary','min')
).reset_index()

   index cinsiyet    avg_salary  max_salary  min_salary
0      0    erkek  28333.333333       55000        5000
1      1    kadın  15000.000000       15000       15000

In [58]:
## SORTING

In [59]:
DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, na_position='last')

NameError: name 'DataFrame' is not defined

In [ ]:
student_df.sort_values(by='Bölüm')

In [ ]:
student_df.sort_values(by='Bölüm', ascending=False)

In [ ]:
## Sort with 2 columns
student_df.sort_values(by=['Bölüm','Yaş'])

In [ ]:
student_df.sort_values(by=['Bölüm','Yaş'], ascending=[True, False] )

In [ ]:
## Group by - Sort
student_df.groupby('Bölüm').count().sort_values(by='Bölüm', ascending=False)

In [ ]:
import pandas as pd

students_data = {
    'İsimler': ['Melike', 'Baris', 'Almila', 'Amir', 'Ceyda'],
    'Yaş': [21, 22, 20, 21, 23,],
    'Bölüm': ['Math', 'Physics', 'Biology', 'Math', 'Physics']
}

students_df = pd.DataFrame(students_data)

ek_satirlar = pd.DataFrame({
    'İsimler': ['Ayşe', 'Mert', np.nan],
    'Yaş': [np.nan, 25, 24],
    'Bölüm': ['Biology', np.nan, 'Math']
})

# Eski ve yeni satırları birleştir
students_df = pd.concat([students_df, ek_satirlar], ignore_index=True)

students_df

In [ ]:
student_df

In [ ]:
students_df.sort_values(by='Bölüm', na_position='first')

In [ ]:
students_df.sort_values(by='Bölüm')

In [ ]:
students_df

In [ ]:
students_df.sort_values(by='Bölüm', na_position='first', inplace=True)

In [ ]:
students_df

## Missing Values

In [ ]:
students_df2=students_df.dropna()

In [ ]:
students_df2

In [ ]:
students_df2=students_df.dropna(subset=['Bölüm'])

In [ ]:
students_df2

In [ ]:
## Fill

students_df2=students_df.fillna(0)
students_df2

In [ ]:
students_df2

In [ ]:
## Fill with Mean
students_df2= students_df
students_df2['Yaş_filled'] = students_df2['Yaş'].fillna(students_df2['Yaş'].mean())
students_df2

In [ ]:
students_df.isnull().sum()

## HW-4

In [ ]:
data1 = pd.read_csv('D:/Ahmet_Emin/GOIT/Python/HW_4/survey_results_public.csv', sep=',')
data1.head()

In [ ]:
data1.shape